#language: ru

@tree

Функционал: 01.Проверка способов расчета.
Ссылка на документацию Юкассы: https://yookassa.ru/developers/payment-acceptance/receipts/54fz/other-services/parameters-values
Признаки способа расчета
| 'Код' | 'Описание'                       |
| '1'   | 'Предоплата полная'   +          |
| '2'   | 'Предоплата частичная'   Нет     |
| '3'   | 'Аванс'                +         |
| '4'   | 'Полный расчет'      +           |
| '5'   | 'Частичный расчет и кредит'  Нет |
| '6'   | 'Передача в кредит' Нет          |
| '7'   | 'Оплата кредита'   +             |



Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: 00. Первоначальная настройка
	И Я открываю основную форму списка справочника "Организации"
	И я жду, что в таблице "Список" количество строк будет "больше" 0 в течение 20 секунд
	И в таблице 'Список' я выбираю текущую строку
	
	И из выпадающего списка с именем 'ПолеФормы_СистемаНалогообложения_0' я выбираю точное значение "Общая"
	И из выпадающего списка с именем 'ПолеФормыСтавкаНДС_0' я выбираю точное значение "Без НДС "
				
	И из выпадающего списка с именем 'ПолеФормы_СистемаНалогообложения_1' я выбираю точное значение "Общая"
	И из выпадающего списка с именем 'ПолеФормыСтавкаНДС_1' я выбираю точное значение "Без НДС "

	И из выпадающего списка с именем 'ПолеФормы_СистемаНалогообложения_2' я выбираю точное значение "Общая"
	И из выпадающего списка с именем 'ПолеФормыСтавкаНДС_2' я выбираю точное значение "Без НДС "
	И я нажимаю на кнопку с именем 'ФормаКнопкаСохранитьИЗакрыть1'

	// Проверка фискализации
	И я открываю основную форму списка справочника "ЭквайринговыеТерминалы"
	И я активизирую дополнение формы с именем 'СтрокаПоиска'
	И в дополнение формы с именем 'СтрокаПоиска' я ввожу текст "юкасса"
	И я жду, что в таблице "Список" количество строк будет "больше" 0 в течение 3 секунд
	И в таблице "Список" я выбираю текущую строку
	И я нажимаю на кнопку с именем 'ОтобразитьВыборТиповФискализации'
	И в меню формы я выбираю 'В Юкассе'
	И я нажимаю на кнопку с именем 'ФормаКнопкаСохранитьИЗакрыть'
		

Сценарий: 01. Проверка payment_mode - 1(Предоплата полная) "full_prepayment"

	И я удаляю все переменные
//Включение авансовой схемы пробития услуг.

	Дано я открываю основную форму списка справочника "Организации"
	И в таблице "Список" я перехожу к строке
		| 'Наименование'      |
		| '<Моя организация>' |
	И в таблице "Список" я выбираю текущую строку
	И я устанавливаю флаг с именем 'АвансоваяСхемаПробитияУслуг'
	И я нажимаю на кнопку с именем 'ФормаКнопкаСохранитьИЗакрыть1'

//Создание клиента и номенклатуры, а также продажи и ее оплата.

	И Я создаю клиента для Юкассы
	И Я создаю Мастера
	И Я создаю ПакетУслуг
//	И Я создаю номенклатуру для Юкассы
//	И я создаю продажу
*Создание реализации.
	И В командном интерфейсе я выбираю "Продажи" "Продажи"
	Тогда открылось окно "Продажи (список)"
	И я нажимаю на кнопку с именем 'Создать'
	И в поле с именем 'Контрагент' я ввожу текст "$$Фамилия$$"
	И из выпадающего списка с именем 'Контрагент' я выбираю "$$Фамилия$$"
*Заполнение табличной части.
	И в таблице 'Запасы' в поле с именем 'ЗапасыНоменклатура' я ввожу текст "$$ПакетУслуг$$"
	И в таблице 'Запасы' из выпадающего списка с именем 'ЗапасыНоменклатура' я выбираю "$$ПакетУслуг$$"
//	Тогда открылось окно 'Выберите сотрудника или считайте его карту'	
//	И я нажимаю на кнопку с именем 'ВсеСотрудники'
//	И в поле с именем 'СтрокаПоиска' я ввожу текст "$$Мастер$$"
//	И я жду, что в таблице 'ТаблицаСотрудников' количество строк будет "больше" 0 в течении 20 секунд
//	И в таблице 'ТаблицаСотрудников' я перехожу к строке по шаблону:
//		| 'Наименование' |
//		| '$$Мастер$$'   |
//	И я нажимаю на кнопку с именем 'Выбрать'

*Создание ссылки на оплату.
	И я нажимаю на кнопку с именем 'Кнопка_Оплаты_Визита'
	И я нажимаю на кнопку с именем 'КассаОплаты_3'
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатаНаименованиеСтрока_1x0'
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатПрименитьеСуммуСтрока_1x0'
	И я нажимаю на кнопку с именем 'Оплатить'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'
	И Я запоминаю значение выражения 'Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг")' в переменную "ТекущаяДата"			

	И я проверяю json
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно 'Статусы оплаты заказов'		
	И я активизирую поле 'Параметры JSON'				
	И элемент формы с именем "ПараметрыJSON" стал равен шаблону '{¶"amount": {¶"value": "500",¶"currency": "RUB"¶},¶"capture": true,¶"description": "Продажа в *:*, * * *. ",¶"confirmation": {¶"type": "redirect",¶"return_url": "ya.ru"¶},¶"receipt": {¶"customer": {¶"full_name": "$$Фамилия$$ ",¶"phone": "*",¶"email": "dimitrii$$Email$$@gmail.com"¶},¶"tax_system_code": 1,¶"items": [¶{¶"description": "$$ПакетУслуг$$",¶"quantity": "1.00",¶"amount": {¶"value": "500",¶"currency": "RUB"¶},¶"vat_code": 1,¶"payment_mode": "full_prepayment",¶"payment_subject": "service"¶}¶]¶},¶"metadata": {¶"cms_name": "fitness1c",¶"ClubID": "939b94d1-24db-11f0-a322-38d547b31ac0",¶"ClubName": "SPA-Салон \\"Меланж\\"",¶"customerNumber": "$$Фамилия$$ ",¶"orderNumber": null¶}¶}'
										
Сценарий: 02. Проверка payment_mode - 2(Аванс - взнос на лицевой счет) "advance"
//Открытие карточки клиента и взнос на лиц.счет.
	Дано Я открываю навигационную ссылку "$$ТекКлиент$$"	
	И я нажимаю на кнопку с именем 'КнопкаДобавитьЛицевыеСчета'
	Тогда открылось окно "Взнос на лицевой счет"
	И я нажимаю на кнопку с именем 'КассаОплаты_3'
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатаНаименованиеСтрока_1x0'
	И в поле с именем 'ПолеВидыОплатВводСуммыСтрока_1x0' я ввожу текст "3 000,00"
	И я перехожу к следующему реквизиту
	И я нажимаю на кнопку с именем 'Оплатить'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'
		
	И я проверяю json			
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно 'Статусы оплаты заказов'		
	И я активизирую поле 'Параметры JSON'
	И элемент формы с именем "ПараметрыJSON" стал равен шаблону '{¶\"amount\": {¶\"value\": \"3000\",¶\"currency\": \"RUB\"¶},¶\"capture\": true,¶\"description\": \"Взнос на лицевой счет\",¶\"confirmation\": {¶\"type\": \"redirect\",¶\"return_url\": \"ya.ru\"¶},¶\"receipt\": {¶\"customer\": {¶\"full_name\": \"$$Фамилия$$ \",¶\"phone\": \"*\",¶\"email\": \"dimitrii$$Email$$@gmail.com\"¶},¶\"tax_system_code\": 1,¶\"items\": [¶{¶\"description\": \"Взнос на лицевой счет\",¶\"quantity\": \"1\",¶\"amount\": {¶\"value\": \"3000\",¶\"currency\": \"RUB\"¶},¶\"vat_code\": 1,¶\"payment_mode\": \"advance\",¶\"payment_subject\": \"payment\"¶}¶]¶},¶\"metadata\": {¶\"cms_name\": \"fitness1c\",¶\"ClubID\": \"939b94d1-24db-11f0-a322-38d547b31ac0\",¶\"ClubName\": \"SPA-Салон \\"Меланж\\"\",¶\"customerNumber\": \"$$Фамилия$$ \",¶\"orderNumber\": null¶}¶}'
		
Сценарий: 03. Проверка payment_mode - 3(Полный расчет) "full_payment"
	И Я создаю номенклатуру для Юкассы
//Отключение авансовой схемы пробития услуг.
	Дано я открываю основную форму списка справочника "Организации"
	И в таблице "Список" я перехожу к строке
		| 'Наименование'      |
		| '<Моя организация>' |
	И в таблице "Список" я выбираю текущую строку
	И я снимаю флаг с именем 'АвансоваяСхемаПробитияУслуг'
	И я нажимаю на кнопку с именем 'ФормаКнопкаСохранитьИЗакрыть1'

//Создание продажи.
	И я создаю продажу
	И я проверяю json
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно 'Статусы оплаты заказов'		
	И я активизирую поле 'Параметры JSON'
	И элемент формы с именем "ПараметрыJSON" стал равен шаблону '{¶\"amount\": {¶\"value\": \"3000\",¶\"currency\": \"RUB\"¶},¶\"capture\": true,¶\"description\": \"Продажа в *:*, * * *. \",¶\"confirmation\": {¶\"type\": \"redirect\",¶\"return_url\": \"ya.ru\"¶},¶\"receipt\": {¶\"customer\": {¶\"full_name\": \"$$Фамилия$$ \",¶\"phone\": \"*\",¶\"email\": \"dimitrii$$Email$$@gmail.com\"¶},¶\"tax_system_code\": 1,¶\"items\": [¶{¶\"description\": \"$$НоменклатураЮкассы$$\",¶\"quantity\": \"1.00\",¶\"amount\": {¶\"value\": \"3000\",¶\"currency\": \"RUB\"¶},¶\"vat_code\": 1,¶\"payment_mode\": \"full_payment\",¶\"payment_subject\": \"service\"¶}¶]¶},¶\"metadata\": {¶\"cms_name\": \"fitness1c\",¶\"ClubID\": \"939b94d1-24db-11f0-a322-38d547b31ac0\",¶\"ClubName\": \"SPA-Салон \\"Меланж\\"\",¶\"customerNumber\": \"$$Фамилия$$ \",¶\"orderNumber\": null¶}¶}'

Сценарий: 04. Проверка payment_mode - 4(Оплата кредита) "credit_payment"
*Создание реализации.
	И В командном интерфейсе я выбираю "Продажи" "Продажи"
	Тогда открылось окно "Продажи (список)"
	И я нажимаю на кнопку с именем 'Создать'
	И в поле с именем 'Контрагент' я ввожу текст "$$Фамилия$$"
	И из выпадающего списка с именем 'Контрагент' я выбираю "$$Фамилия$$"
*Заполнение табличной части.
	И в таблице 'Запасы' в поле с именем 'ЗапасыНоменклатура' я ввожу текст "$$ПакетУслуг$$"
	И в таблице 'Запасы' из выпадающего списка с именем 'ЗапасыНоменклатура' я выбираю "$$ПакетУслуг$$"
	И я нажимаю на кнопку с именем 'КнопкаЗаписать'
	Дано я сохраняю навигационную ссылку текущего окна в переменную "ПродажаВКредит"
	И я нажимаю на кнопку с именем 'Кнопка_Оплаты_Визита'
	И я нажимаю на кнопку с именем 'КассаОплаты_3'
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатаНаименованиеСтрока_0'	
	И в поле с именем 'ПолеВидыОплатВводСуммыСтрока_0' я ввожу текст "250,00"
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатПрименитьеСуммуСтрока_0'
	И я нажимаю на кнопку с именем 'Оплатить'
	И я нажимаю на кнопку с именем 'Button0'
	Если открылось окно "Внимание" Тогда
		И я нажимаю на кнопку с именем 'Button0'
		И я нажимаю на гиперссылку с именем 'ДекорацияZОтчета_0'
		И я нажимаю на кнопку с именем 'ПодтвердитьЗакрытиеСмены'
	// ИСПРАВЛЕНО в обход оплаты в самом документе продажи (22.01.2025)
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Продажи" "Продажи"
	Тогда открылось окно "Продажи (список)"
	И я нажимаю на кнопку с именем 'СписокОплатитьДокумент'	
	И я нажимаю на кнопку с именем 'КассаОплаты_3'
	Когда открылось окно "Оплата"
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатаНаименованиеСтрока_1x0'
	И я нажимаю на кнопку с именем 'КнопкаВидыОплатПрименитьеСуммуСтрока_1x0'
	И я нажимаю на кнопку с именем 'Оплатить'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'
	И я нажимаю на кнопку с именем 'СформироватьСсылкуНаОплатуСВыбраннойСуммой'

	И я проверяю json
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно 'Статусы оплаты заказов'		
	И я активизирую поле 'Параметры JSON'		
	И элемент формы с именем "ПараметрыJSON" стал равен шаблону '{¶\"amount\": {¶\"value\": \"250\",¶\"currency\": \"RUB\"¶},¶\"capture\": true,¶\"description\": \"Продажа в *:*, * * *. \",¶\"confirmation\": {¶\"type\": \"redirect\",¶\"return_url\": \"ya.ru\"¶},¶\"receipt\": {¶\"customer\": {¶\"full_name\": \"$$Фамилия$$ \",¶\"phone\": \"*\",¶\"email\": \"dimitrii$$Email$$@gmail.com\"¶},¶\"tax_system_code\": 1,¶\"items\": [¶{¶\"description\": \"$$ПакетУслуг$$\",¶\"quantity\": \"1.00\",¶\"amount\": {¶\"value\": \"250\",¶\"currency\": \"RUB\"¶},¶\"vat_code\": 1,¶\"payment_mode\": \"credit_payment\",¶\"payment_subject\": \"payment\"¶}¶]¶},¶\"metadata\": {¶\"cms_name\": \"fitness1c\",¶\"ClubID\": \"939b94d1-24db-11f0-a322-38d547b31ac0\",¶\"ClubName\": \"SPA-Салон \\"Меланж\\"\",¶\"customerNumber\": \"$$Фамилия$$ \",¶\"orderNumber\": null¶}¶}'